Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException.Expression Property
 Gets the invalid expression.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Expression Expression { get; }
Public ReadOnly Property Expression As Expression
	Get
Property Value
Type: Expression
See Also
Reference
InvalidFilterExpressionException Class
Tekla.Structures.Filtering Namespace